Public Attributes | List of all members
API_PersCamSetPars Struct Reference
Element Manager API
Represents a perspective camera set. More...
#include <APIdefs_Elements.h>
 Public Attributes
bool  | openedPath
Open or closed animation path?
bool  | bezierPath
Generate the in-between frames along polygonal or Bezier animation path?
bool  | smoothTarget
Generate the in-between frames along a straight line or a smooth curve?
short  | pen
Pen attribute index of the camera and the path.
Int32  | inFrames
Number of the in-between frames.
Int32  | showFrom
First camera index in slide.
Int32  | showTo
Last camera index in slide.
Detailed Description
Represents a perspective camera set.
Remarks
These fields correspond to the fields of the Path Options dialog.
Member Data Documentation
◆ bezierPath
 API_PersCamSetPars::bezierPath
Generate the in-between frames along polygonal or Bezier animation path?
◆ inFrames
 API_PersCamSetPars::inFrames
Number of the in-between frames.
◆ openedPath
 API_PersCamSetPars::openedPath
Open or closed animation path?
◆ pen
 API_PersCamSetPars::pen
Pen attribute index of the camera and the path.
◆ showFrom
 API_PersCamSetPars::showFrom
First camera index in slide.
◆ showTo
 API_PersCamSetPars::showTo
Last camera index in slide.
◆ smoothTarget
 API_PersCamSetPars::smoothTarget
Generate the in-between frames along a straight line or a smooth curve?